class Food {
  constructor(name, des, image) {
    this.name = name;
    this.des = des;
    this.image = image;
  }
}

class FoodList {
  constructor() {}
  foods = [
    new Food(
      "សម្លកកូរ",
      "សម្លកកូរ ត្រូវ​បាន​គេ​បរិភោគ​រាប់​រយ​ឆ្នាំ​មក​ហើយ ហើយ​សព្វ​ថ្ងៃ​នេះ​អាច​រក​បាន​នៅ​តាម​ភោជនីយដ្ឋាន កន្លែង​អង្គុយ​តាម​ផ្លូវ និង​ផ្ទះ​គ្រួសារ។",
      "../img/food/korkor.jpg"
    ),
    new Food(
      "នំបញ្ចុក",
      "នំបញ្ចុក មុខម្ហូបនេះមានគុយទាវស្រស់ៗដែលហត់ចេញពីអង្ករ ប្រឡាក់ដោយទឹកប្រហិតត្រីងៀតដែលធ្វើពីស្លឹកគ្រៃ ខ្ញី រមៀត និងខ្ទឹមស។ ត្រសក់ស្រស់ ផ្កាចេក សណ្ដែកវែង ផ្កាដែលអាចបរិភោគបាន និងស្លឹកព្រៃត្រូវបានរុំពីលើ",
      "../img/food/nombanhchok.jpg"
    ),
    new Food(
      "អាម៉ុក",
      "អាម៉ុក​ គឺ​ជា​ការី​ធ្វើ​ដោយ​ទឹក​ដូង​ស្រស់ និង​ក្រៀម។ ជាប្រពៃណី ម្ហូបនេះត្រូវបានធ្វើឡើងដោយត្រី ឬខ្យង ប៉ុន្តែឥឡូវនេះអ្នកអាចរកឃើញសាច់មាន់ និងសូម្បីតែបួស។",
      "../img/food/amok.jpg"
    ),
    new Food(
      "បាយសាច់ជ្រូក",
      "បាយសាច់ជ្រូក បម្រើពេលព្រឹកព្រលឹមនៅកាច់ជ្រុងផ្លូវនានាទូទាំងប្រទេសកម្ពុជា បាយសឈូក ឬសាច់ជ្រូក និងបាយ គឺជាមុខម្ហូបដ៏សាមញ្ញបំផុត និងឆ្ងាញ់បំផុតនៅក្នុងប្រទេសមានផ្តល់ជូន។",
      "../img/food/baisachchroik.jpg"
    ),
    new Food(
      "ការីសាច់មាន់",
      "ការីសាច់មាន់ រសជាតិហឹរតិចជាងការីរបស់ប្រទេសថៃជិតខាង សម្លការីក្រហមរបស់កម្ពុជា ធ្វើឡើងដោយប្រើម្ទេសក្រហមក្នុងស្រុកធំៗ ដែលមានរសជាតិស្រាលគួរឲ្យកត់សម្គាល់ បង្កើតបានជាម្ហូបដ៏សម្បូរបែប ប៉ុន្តែមានរសជាតិឆ្ងាញ់។",
      "../img/food/karisachmaon.jpg"
    ),
    new Food(
      "បុកត្រប់ពុតលំញង",
      "បុក ដែលបកប្រែថា 'កម្ទេច' សំដៅលើរចនាប័ទ្មនៃការរៀបចំម្ហូបអាហារដែលពាក់ព័ន្ធនឹងការបុកគ្រឿងផ្សំនៅក្នុងបាយអឈើដ៏ធំមួយ។ ត្រប់ពុតលំញង ជា​ពង​កូន​ល្វីង​តូច ដែល​ដុះ​នៅ​ក្នុង​ប្រទេស​កម្ពុជា។",
      "../img/food/boktrop.jpg"
    ),
    new Food(
      "ខគោ",
      "ពាក្យថា ខា សំដៅលើរបៀបធ្វើម្ហូបមួយក្នុងប្រទេសកម្ពុជា ដែលស្ករត្នោតត្រូវបានប្រឡាក់ទៅជាទឹកស៊ីរ៉ូស្អិត បន្ទាប់មកប្រើជាមូលដ្ឋាននៃម្ហូប។ កំណែសាច់គោមានរសជាតិស្មុគស្មាញអស្ចារ្យ។",
      "../img/food/khasachko.jpg"
    ),
    new Food(
      "ប្រហុកខ្ទិះ",
      "ប្រហុកខ្ទិះ ចម្អិន​ជាមួយ​ខ្ទិះដូង​ស្រស់ ស្ករត្នោត និង​សាច់ជ្រូក​ចិញ្ច្រាំ ប្រហុក​ប្រហុក (​ប្រហុក​ប្រៃ​ប្រឡាក់​ប្រឡាក់) ប្រែជា​ស្រួយ​ល្មម​សម្រាប់​ភ្ញៀវ​ដែល​ភ័យ​ចង់​កម្សាន្ត។",
      "../img/food/prahokktis.jpg"
    ),
    new Food(
      "ស្ងោជ្រក់សាច់ត្រី",
      "ត្រីនេះត្រូវបានចម្អិននៅក្នុងទំពាំងបាយជូរស្លឹកគ្រៃស្រាលៗដែលលាយជាមួយនឹងទឹកកំបោរ និងខ្ទឹមសចៀន ធ្វើឱ្យស៊ុបមានរសជាតិឆ្ងាញ់ដែលបម្រើជាមួយឱសថក្នុងស្រុក រួមទាំង basil អាស៊ី និងស្លឹកខ្ទឹម។",
      "../img/food/sngorchrouksachtrei.jpg"
    ),
    new Food(
      "ការីសារ៉ាម៉ាន់",
      "ការីដូងដ៏សំបូរបែបនេះគឺជាមុខម្ហូបដ៏ស្មុគស្មាញបំផុតមួយរបស់ប្រទេសកម្ពុជា ហើយត្រូវបានផ្សំឡើងដោយគ្រឿងទេស ដោយមានស្លឹកខ្ទឹម និងសំបកដើមខ្ទឹមដែលលេចធ្លោជាងគេ។ ការី​ត្រូវ​បាន​ប្រឡាក់​ជាមួយ​សណ្ដែក​ដី​ទាំង​មូល ហើយ​ច្រើន​តែ​ត្រូវ​បាន​គេ​បម្រើ​ជាមួយ​នឹង baguette ចំណិត។",
      "../img/food/karisaraman.jpg"
    ),
    new Food(
      "ទឹកគ្រឿង",
      "ម្ហូបដ៏ពេញនិយមមួយរបស់កម្ពុជា ទឹកក្រូច គឺជាទឹកជ្រលក់ស្តើងៗ ប៉ុន្តែមានក្លិនឈ្ងុយ ផលិតពីត្រីទន្លេស្រស់ និងត្រីដែលមានជាតិ fermented បម្រើជាមួយអារេជាច្រើននៃបន្លែ និងឱសថតាមរដូវ។",
      "../img/food/tuekkroeung.jpg"
    ),
    new Food(
      "មីកូឡា",
      "ជនជាតិ​កូឡា​ជា​ជនជាតិ​ភាគតិច​នៅ​កម្ពុជា។ គុយទាវ​កូឡា​ត្រូវ​បាន​ប្រឡាក់​ដោយ​បង្គា​ក្រៀម ចំណិត​ស៊ុត​ស្ងោរ ត្រសក់ សណ្ដែក​ដី និង​ឱសថ​ស្រស់ៗ ហើយ​លាយ​ជាមួយ​ទឹក​ក្រូចឆ្មារ​ខ្ទឹម​ស។",
      "../img/food/mikola.jpg"
    ),
    new Food(
      "ភ្លាសាច់គោ",
      "សាច់គោច្រើនជាងសាឡាដ plea sach ko គឺជាមុខម្ហូបសម្រាប់ពិធីជប់លៀងដែលបម្រើក្នុងឱកាសបុណ្យនានា ដូចជាពិធីមង្គលការ ឬជាមួយស្រាបៀរក្នុងពេលរាត្រីនៅទីប្រជុំជន។",
      "../img/food/pleasachko.jpg"
    ),
    new Food(
      "សម្លម្ជូគ្រឿងសាច់គោ",
      "ស៊ុបដ៏ឈ្ងុយឆ្ងាញ់នេះគឺជាថ្នាំបំបាត់ការឈឺចាប់ដ៏ល្អឥតខ្ចោះចំពោះការហៀរសំបោរ ផ្តាសាយ ឬថ្ងៃត្រូពិចដែលមានភ្លៀងធ្លាក់។ វា​មក​ជា​ពីរ​បែប​គឺ​ធម្មតា​ឬ​គី​ធី​ជាមួយ​ទឹកដោះគោ​ដូង​។",
      "../img/food/samlormachukroeungsachko.jpg"
    ),
    new Food(
      "សម្លប្រហើរ",
      "មូលដ្ឋាន​របស់​ស៊ុប​គឺ​ជា​ស្លឹកគ្រៃ​ដែល​ធ្វើ​ដោយ​ខ្ញី ហើយ​វា​អាច​ធ្វើ​ជាមួយ​នឹង​បន្លែ​គ្រប់​ចំនួន តាម​ធម្មតា​ដាំ​តាម​ផ្ទះ ឬ​ចំណី​អាហារ។",
      "../img/food/somlarproher.jpg"
    ),
  ];
  render() {
    const foodListEle = document.getElementById("food_list");
    this.foods.forEach((food) => {
      const foodEle = document.createElement("div");
      foodEle.className = "food";
      foodEle.innerHTML = `
      <div class="food-image">
      <img src=${food.image} alt="" />
    </div>
    <div class="food-info">
      <div class="food-title">
        <h5 class="title">${food.name}</h5>
      </div>
      <div class="food-des">
        <p class="des">
          ${food.des}
        </p>
      </div>
    </div>
      `;
      foodListEle.appendChild(foodEle);
    });
  }
}
const app = new FoodList();
app.render();
